# Tratando dados duplicados

In [1]:
import pandas as pd
import numpy as np
from os import getcwd

In [13]:
file=getcwd()+'\\'+input()
columns=['id','age','gender','job','zip_code']
users=pd.read_csv(file,sep='|',names=columns,header=None)
users.head(10)

duplicadas.txt

   id  age gender         job  zip_code
0   1   24      M  technician     85711
1   2   53      F       other     94043
2   3   23      M      writer     32067
3   1   24      M  technician     85711
4   4   24      M  technician     43537
5   5   33      F       other     15213
6   5   33      F       other     15213
7   1   24      M  technician     85711

In [6]:
#Utilizando duplicated()
users.zip_code.duplicated().head()

0    False
1    False
2    False
3     True
4    False
Name: zip_code, dtype: bool

In [7]:
users.zip_code.duplicated().sum()

3

In [9]:
#Utilizando na linha inteiro
users.duplicated().sum()

3

In [14]:
#Mantendo a primeira aparição
users.drop_duplicates(keep='first')

   id  age gender         job  zip_code
0   1   24      M  technician     85711
1   2   53      F       other     94043
2   3   23      M      writer     32067
4   4   24      M  technician     43537
5   5   33      F       other     15213

In [15]:
#Mantendo a ultima aparição
users.drop_duplicates(keep='last')

   id  age gender         job  zip_code
1   2   53      F       other     94043
2   3   23      M      writer     32067
4   4   24      M  technician     43537
6   5   33      F       other     15213
7   1   24      M  technician     85711

In [16]:
#Não manter nenhum duplicado
users.drop_duplicates(keep=False)

   id  age gender         job  zip_code
1   2   53      F       other     94043
2   3   23      M      writer     32067
4   4   24      M  technician     43537

In [17]:
file=getcwd()+'\\'+input()
columns=['id','age','gender','job','zip_code']
users=pd.read_csv(file,sep='|',names=columns,header=None,index_col='id')
users.head(10)

espectadores.txt

    age gender            job zip_code
id
1    24      M     technician    85711
2    53      F          other    94043
3    23      M         writer    32067
4    24      M     technician    43537
5    33      F          other    15213
6    42      M      executive    98101
7    57      M  administrator    91344
8    36      M  administrator    05201
9    29      M        student    01002
10   53      M         lawyer    90703

In [20]:
users.zip_code.duplicated().sum()

148

In [21]:
users.duplicated().sum()

7

In [22]:
#Caso queira selecionar apenas duas colunas só colocar dentro do duplicated() subset=['coluna1','colunas2']
users.duplicated(subset=['age','zip_code']).sum()

16

In [25]:
users.drop_duplicates().head()

    age gender         job zip_code
id
1    24      M  technician    85711
2    53      F       other    94043
3    23      M      writer    32067
4    24      M  technician    43537
5    33      F       other    15213